---
kind: method
id: M:Autodesk.Revit.DB.GroupSet.ReverseIterator
source: html/8ad9f77b-59b8-9f54-2e78-1d7ed9745087.htm
---
# Autodesk.Revit.DB.GroupSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual GroupSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.